-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 01, 2020 at 11:39 AM
-- Server version: 10.4.8-MariaDB
-- PHP Version: 7.2.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `result-system`
--

-- --------------------------------------------------------

--
-- Table structure for table `subjects`
--

CREATE TABLE `subjects` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) COLLATE utf8_unicode_ci NOT NULL,
  `code` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `dept_id` bigint(20) UNSIGNED NOT NULL,
  `semester_id` bigint(20) UNSIGNED NOT NULL,
  `hours` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `subjects`
--

INSERT INTO `subjects` (`id`, `name`, `code`, `dept_id`, `semester_id`, `hours`, `created_at`, `updated_at`) VALUES
(1, 'عربي', '111', 1, 1, '2', '2020-06-30 09:06:28', '2020-06-30 09:06:28'),
(2, 'مبادئ ادارة', '112', 1, 1, '2', '2020-06-30 11:43:43', '2020-07-01 07:08:41'),
(3, 'انجليزي', '113', 1, 1, '2', '2020-06-30 11:44:03', '2020-06-30 11:44:03'),
(4, 'دراسات سودانية', '114', 1, 1, '2', '2020-06-30 11:45:14', '2020-06-30 11:45:14'),
(5, 'دراسات اسلامية', '115', 1, 1, '2', '2020-06-30 11:45:38', '2020-06-30 11:45:38'),
(6, 'مبادئ حسبان', '116', 1, 1, '2', '2020-06-30 11:46:08', '2020-07-01 07:07:46'),
(7, 'اساسيات حاسوب', '117', 1, 1, '3', '2020-06-30 11:46:36', '2020-06-30 11:46:36'),
(8, 'عربي2', '128', 1, 2, '2', '2020-06-30 11:47:06', '2020-06-30 11:47:06'),
(9, 'مبادئ احصاء واحتمالات', '129', 1, 2, '2', '2020-06-30 11:47:23', '2020-07-01 07:11:30'),
(10, 'انجليزي2', '1210', 1, 2, '2', '2020-06-30 11:47:41', '2020-06-30 11:47:41'),
(11, 'اساليب برمجة', '1211', 1, 2, '3', '2020-06-30 11:48:08', '2020-06-30 11:48:08'),
(12, 'معادلات تفاضلية', '1212', 1, 2, '2', '2020-06-30 11:48:36', '2020-07-01 07:12:55'),
(13, 'ثقافة اسلامية', '1213', 1, 2, '2', '2020-06-30 11:48:59', '2020-07-01 07:13:41'),
(14, 'تطبيقات حاسوب', '1214', 1, 2, '2', '2020-06-30 11:49:36', '2020-07-01 07:12:08'),
(15, 'مبادئ المحاسبة', '1115', 1, 1, '2', '2020-07-01 07:09:48', '2020-07-01 07:09:48'),
(16, 'مبادئ اقتصاد', '1316', 1, 3, '2', '2020-07-01 07:15:09', '2020-07-01 07:15:09'),
(17, 'مبادئ ادارة', '1317', 1, 3, '2', '2020-07-01 07:15:29', '2020-07-01 07:15:29'),
(18, 'جبر خطي وهندسة تحليلية', '1318', 1, 3, '3', '2020-07-01 07:16:05', '2020-07-01 07:16:05'),
(19, 'هياكل بيانات', '1319', 1, 3, '3', '2020-07-01 07:16:27', '2020-07-01 07:16:27'),
(20, 'مبادئ نظم التشغيل', '1320', 1, 3, '3', '2020-07-01 07:16:54', '2020-07-01 07:16:54'),
(21, 'مبادئ تسويق', '1321', 1, 3, '2', '2020-07-01 07:17:19', '2020-07-01 07:17:19'),
(22, 'اساليب برمجة (2)', '1322', 1, 3, '3', '2020-07-01 07:18:02', '2020-07-01 07:18:02'),
(23, 'بحوث عمليات', '1423', 1, 4, '2', '2020-07-01 07:18:26', '2020-07-01 07:18:26'),
(24, 'تحليل وتصميم نظم (2)', '1424', 1, 4, '3', '2020-07-01 07:18:50', '2020-07-01 07:18:50'),
(25, 'تقنيات انترنت (1)', '1425', 1, 4, '3', '2020-07-01 07:19:18', '2020-07-01 07:19:18'),
(26, 'شبكات الحاسوب', '1426', 1, 4, '3', '2020-07-01 07:19:42', '2020-07-01 07:19:42'),
(27, 'معمارية الحاسوب', '1427', 1, 4, '3', '2020-07-01 07:20:06', '2020-07-01 07:20:06'),
(28, 'قضايا واخلاقيات المهنة', '1428', 1, 4, '3', '2020-07-01 07:20:30', '2020-07-01 07:20:30'),
(29, 'تطبيقات لينكس', '1429', 1, 4, '2', '2020-07-01 07:21:01', '2020-07-01 07:21:01'),
(30, 'تطبيقات الحاسوب (1)', '1330', 1, 3, '2', '2020-07-01 07:21:27', '2020-07-01 07:21:27'),
(31, 'تطبيقات الحاسوب (2)', '1431', 1, 4, '2', '2020-07-01 07:21:52', '2020-07-01 07:21:52'),
(32, 'جبر خطي وهندسة تحليلية', '1532', 1, 5, '2', '2020-07-01 07:23:07', '2020-07-01 07:23:07'),
(33, 'هندسة برمجيات (1)', '1533', 1, 5, '3', '2020-07-01 07:23:32', '2020-07-01 07:23:32'),
(34, 'نظم ادارة قواعد بيانات', '1534', 1, 5, '3', '2020-07-01 07:23:56', '2020-07-01 07:23:56'),
(35, 'تحليل وتصميم خوارزميات', '1535', 1, 5, '3', '2020-07-01 07:24:23', '2020-07-01 07:24:23'),
(36, 'نظم المعلومات الادارية', '1536', 1, 5, '2', '2020-07-01 07:24:57', '2020-07-01 07:24:57'),
(37, 'معمارية الحاسوب', '1637', 1, 6, '2', '2020-07-01 07:25:22', '2020-07-01 07:25:22'),
(38, 'ذكاء اصطناعي', '1638', 1, 6, '3', '2020-07-01 07:25:44', '2020-07-01 07:25:44'),
(39, 'أساليب حديثة لتطبيقات البرمجة', '1639', 1, 6, '3', '2020-07-01 07:26:11', '2020-07-01 07:26:11'),
(40, 'التفاعل بين الانسان والحاسوب', '1640', 1, 6, '3', '2020-07-01 07:26:32', '2020-07-01 07:26:32'),
(41, 'نظم تشغيل', '1641', 1, 6, '3', '2020-07-01 07:27:00', '2020-07-01 07:27:00'),
(42, 'اساسيات الشبكات', '1542', 1, 5, '3', '2020-07-01 07:27:35', '2020-07-01 07:27:35'),
(43, 'اساليب برمجة (3)', '1543', 1, 5, '3', '2020-07-01 07:28:04', '2020-07-01 07:28:04'),
(44, 'تقنيات انترنت (2)', '1544', 1, 5, '3', '2020-07-01 07:28:31', '2020-07-01 07:28:31'),
(45, 'بحوث عمليات', '1645', 1, 6, '2', '2020-07-01 07:28:53', '2020-07-01 07:28:53'),
(46, 'هندسة برمجيات', '1646', 1, 6, '3', '2020-07-01 07:29:17', '2020-07-01 07:29:17'),
(47, 'تطبيقات قواعد البيانات', '1647', 1, 6, '3', '2020-07-01 07:29:40', '2020-07-01 07:29:40'),
(48, 'البرمجة المرئية', '1748', 1, 7, '3', '2020-07-01 07:30:25', '2020-07-01 07:30:25'),
(49, 'ادارة شبكات الحاسوب', '1749', 1, 7, '3', '2020-07-01 07:30:48', '2020-07-01 07:30:48'),
(50, 'ادارة المشاريع البرمجية', '1750', 1, 7, '3', '2020-07-01 07:31:14', '2020-07-01 07:31:14'),
(51, 'اساسيات تجارة الكترونية', '1751', 1, 7, '3', '2020-07-01 07:31:40', '2020-07-01 07:31:40'),
(52, 'قواعد بيانات متقدمة', '1752', 1, 7, '3', '2020-07-01 07:32:06', '2020-07-01 07:32:06'),
(53, 'مناهج بحث علمي', '1753', 1, 7, '3', '2020-07-01 07:32:29', '2020-07-01 07:32:29'),
(54, 'نظم الوسائط المتعددة', '1754', 1, 7, '3', '2020-07-01 07:32:59', '2020-07-01 07:32:59'),
(55, 'برمجة شبكات', '1855', 1, 8, '3', '2020-07-01 07:33:27', '2020-07-01 07:33:27'),
(56, 'اخلاقيات المهنة', '1856', 1, 8, '3', '2020-07-01 07:33:56', '2020-07-01 07:33:56'),
(57, 'تنقيب بيانات', '1857', 1, 8, '3', '2020-07-01 07:34:31', '2020-07-01 07:34:31'),
(58, 'نظم دعم القرار', '1858', 1, 8, '3', '2020-07-01 07:34:54', '2020-07-01 07:34:54'),
(59, 'تشفير وأمن شبكات', '1859', 1, 8, '3', '2020-07-01 07:35:18', '2020-07-01 07:35:18'),
(60, 'ادارة شبكات لينكس', '1860', 1, 8, '3', '2020-07-01 07:35:41', '2020-07-01 07:35:41');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`id`),
  ADD KEY `subjects_dept_id_foreign` (`dept_id`),
  ADD KEY `subjects_semester_id_foreign` (`semester_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `subjects`
--
ALTER TABLE `subjects`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `subjects`
--
ALTER TABLE `subjects`
  ADD CONSTRAINT `subjects_dept_id_foreign` FOREIGN KEY (`dept_id`) REFERENCES `depts` (`id`),
  ADD CONSTRAINT `subjects_semester_id_foreign` FOREIGN KEY (`semester_id`) REFERENCES `semesters` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
